In [15]:
import pandas as pd
import numpy as np

In [16]:
data = {
    'Runner': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah'],
    'last_name': ['Morgan', 'Thompson', 'Reed', 'Santiago', 'Kim', 'Nguyen', 'Patel', 'Brooks'],
    'Marathon_Time_hrs': [3.5, 4.0, 3.2, 4.5, 3.8, 4.1, 3.9, 4.3],
    'Fifty_Miler_Time_hrs': [8.0, 9.5, 7.8, 10.2, 9.0, 10.0, 9.2, 10.5],
    'Hundred_Miler_Time_hrs': [20.5, 23.0, 18.7, 25.2, 21.5, 24.1, 22.3, 26.0],
    'last_race_date': ['04/27/2025', '05/24/2025', '12/13/2025', '04/27/2025', '05/24/2025', '12/13/2025', '04/27/2025', '05/24/2025'],
    'running_club_id': [123, 345, 123, 678, 342, 123, 345, 123],
}
df=pd.DataFrame(data)

In [17]:
df.head()

,Runner,last_name,Marathon_Time_hrs,Fifty_Miler_Time_hrs,Hundred_Miler_Time_hrs,last_race_date,running_club_id
0,Alice,Morgan,3.5,8.0,20.5,04/27/2025,123
1,Bob,Thompson,4.0,9.5,23.0,05/24/2025,345
2,Charlie,Reed,3.2,7.8,18.7,12/13/2025,123
3,Diana,Santiago,4.5,10.2,25.2,04/27/2025,678
4,Ethan,Kim,3.8,9.0,21.5,05/24/2025,342

In [18]:
# accessing a column
df['Runner']

0      Alice
1        Bob
2    Charlie
3      Diana
4      Ethan
5      Fiona
6     George
7     Hannah
Name: Runner, dtype: object

In [19]:
df.Runner

0      Alice
1        Bob
2    Charlie
3      Diana
4      Ethan
5      Fiona
6     George
7     Hannah
Name: Runner, dtype: object

In [20]:
df[['Runner','Marathon_Time_hrs']]

    Runner  Marathon_Time_hrs
0    Alice                3.5
1      Bob                4.0
2  Charlie                3.2
3    Diana                4.5
4    Ethan                3.8
5    Fiona                4.1
6   George                3.9
7   Hannah                4.3

In [21]:
# get all columns
df.columns

Index(['Runner', 'last_name', 'Marathon_Time_hrs', 'Fifty_Miler_Time_hrs',
       'Hundred_Miler_Time_hrs', 'last_race_date', 'running_club_id'],
      dtype='object')

In [22]:
df.columns.values

array(['Runner', 'last_name', 'Marathon_Time_hrs', 'Fifty_Miler_Time_hrs',
       'Hundred_Miler_Time_hrs', 'last_race_date', 'running_club_id'],
      dtype=object)

In [23]:
list(df)

['Runner',
 'last_name',
 'Marathon_Time_hrs',
 'Fifty_Miler_Time_hrs',
 'Hundred_Miler_Time_hrs',
 'last_race_date',
 'running_club_id']

In [24]:
list(df.columns)

['Runner',
 'last_name',
 'Marathon_Time_hrs',
 'Fifty_Miler_Time_hrs',
 'Hundred_Miler_Time_hrs',
 'last_race_date',
 'running_club_id']

In [25]:
sorted(df.columns)

['Fifty_Miler_Time_hrs',
 'Hundred_Miler_Time_hrs',
 'Marathon_Time_hrs',
 'Runner',
 'last_name',
 'last_race_date',
 'running_club_id']

In [26]:
for column_name in df.columns:
    print(column_name)

Runner
last_name
Marathon_Time_hrs
Fifty_Miler_Time_hrs
Hundred_Miler_Time_hrs
last_race_date
running_club_id

In [27]:
df.keys().to_list()

['Runner',
 'last_name',
 'Marathon_Time_hrs',
 'Fifty_Miler_Time_hrs',
 'Hundred_Miler_Time_hrs',
 'last_race_date',
 'running_club_id']

In [30]:
num_rows=100
num_cols=100
data=np.random.rand(num_rows,num_cols)

In [31]:
column_names=[f'col_{i+1}' for i in range(num_cols)]

In [32]:
df_100=pd.DataFrame(data,columns=column_names)
df_100

,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9,col_10,...,col_91,col_92,col_93,col_94,col_95,col_96,col_97,col_98,col_99,col_100
0,0.713219,0.893378,0.410655,0.398028,0.758324,0.078793,0.495383,0.494462,0.847206,0.028640,...,0.638348,0.161864,0.772086,0.221820,0.952525,0.318323,0.175612,0.353488,0.597196,0.295063
1,0.797938,0.924110,0.270120,0.374858,0.566839,0.929436,0.245763,0.107419,0.083536,0.582475,...,0.107940,0.039179,0.127920,0.083244,0.808107,0.348827,0.868803,0.905824,0.945200,0.771413
2,0.439811,0.086186,0.341558,0.144814,0.391471,0.504328,0.770542,0.667305,0.050562,0.716893,...,0.366660,0.390721,0.533652,0.149035,0.578259,0.930614,0.268635,0.491164,0.051956,0.722272
3,0.293636,0.873846,0.009130,0.066908,0.246297,0.105737,0.093015,0.543471,0.571073,0.282793,...,0.209406,0.552559,0.393887,0.447392,0.122203,0.720952,0.176512,0.566959,0.085161,0.946001
4,0.642654,0.404800,0.204160,0.763294,0.103074,0.865895,0.906807,0.090661,0.697151,0.332483,...,0.857917,0.291485,0.451676,0.300983,0.378158,0.840905,0.925862,0.841389,0.841803,0.700470
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.015775,0.971711,0.117906,0.123630,0.187177,0.290402,0.203732,0.807622,0.542340,0.783063,...,0.115614,0.305291,0.750212,0.882466,0.345521,0.611776,0.078723,0.194987,0.687396,0.312449
96,0.068830,0.747331,0.829713,0.814780,0.781952,0.466058,0.333674,0.052885,0.647080,0.559320,...,0.096956,0.856156,0.713070,0.428268,0.435354,0.244489,0.794346,0.826415,0.325487,0.129116
97,0.309280,0.284127,0.100897,0.846481,0.672287,0.917811,0.064383,0.809418,0.312539,0.234520,...,0.879523,0.063863,0.417463,0.586070,0.245833,0.278600,0.195705,0.574291,0.594224,0.721894
98,0.572348,0.942743,0.633753,0.120935,0.474547,0.336529,0.780664,0.515143,0.574474,0.038279,...,0.044962,0.598027,0.423976,0.803644,0.875698,0.495491,0.089087,0.260980,0.243936,0.996558
99,0.950129,0.481852,0.917861,0.092808,0.320029,0.321762,0.829474,0.168499,0.259793,0.735874,...,0.739128,0.704366,0.041837,0.643732,0.259210,0.008092,0.853923,0.265228,0.945069,0.054816

In [33]:
# column types
df.dtypes

Runner                     object
last_name                  object
Marathon_Time_hrs         float64
Fifty_Miler_Time_hrs      float64
Hundred_Miler_Time_hrs    float64
last_race_date             object
running_club_id             int64
dtype: object

In [34]:
# convert column types
df['last_race_date']=pd.to_datetime(df['last_race_date'])

In [35]:
# change to float 
df['running_club_id']=df['running_club_id'].astype('float')

In [36]:
# rename columns
df.rename(columns={'Marathon_Time_hrs':'262_Time_hrs'},inplace=True)

In [37]:
# create columns from numbers
df['total_time']=df['262_Time_hrs']+df['Fifty_Miler_Time_hrs']+df['Hundred_Miler_Time_hrs']

In [38]:
# create new column from string
df['full_name']=df['Runner']+' '+df['last_name']

In [40]:
# create a new column from new data 
shirt_sizes = ['S', 'M', 'M', 'L', 'M', 'S', 'L', 'XL']
df['race_shirt_size']=shirt_sizes
df.head()

,Runner,last_name,262_Time_hrs,Fifty_Miler_Time_hrs,Hundred_Miler_Time_hrs,last_race_date,running_club_id,total_time,full_name,race_shirt_size
0,Alice,Morgan,3.5,8.0,20.5,2025-04-27,123.0,32.0,Alice Morgan,S
1,Bob,Thompson,4.0,9.5,23.0,2025-05-24,345.0,36.5,Bob Thompson,M
2,Charlie,Reed,3.2,7.8,18.7,2025-12-13,123.0,29.7,Charlie Reed,M
3,Diana,Santiago,4.5,10.2,25.2,2025-04-27,678.0,39.9,Diana Santiago,L
4,Ethan,Kim,3.8,9.0,21.5,2025-05-24,342.0,34.3,Ethan Kim,M

In [42]:
df.drop(columns='race_shirt_size',inplace=True)

In [43]:
# reorder columns 
df = df[['full_name', 'running_club_id', 'Hundred_Miler_Time_hrs', 'Fifty_Miler_Time_hrs', '262_Time_hrs']]

In [44]:
# set index
df.set_index('full_name')

,running_club_id,Hundred_Miler_Time_hrs,Fifty_Miler_Time_hrs,262_Time_hrs
full_name,,,,
Alice Morgan,123.0,20.5,8.0,3.5
Bob Thompson,345.0,23.0,9.5,4.0
Charlie Reed,123.0,18.7,7.8,3.2
Diana Santiago,678.0,25.2,10.2,4.5
Ethan Kim,342.0,21.5,9.0,3.8
Fiona Nguyen,123.0,24.1,10.0,4.1
George Patel,345.0,22.3,9.2,3.9
Hannah Brooks,123.0,26.0,10.5,4.3

In [45]:
df = df.set_index(['full_name', 'running_club_id'])

In [46]:
# reset index
df.reset_index()

,full_name,running_club_id,Hundred_Miler_Time_hrs,Fifty_Miler_Time_hrs,262_Time_hrs
0,Alice Morgan,123.0,20.5,8.0,3.5
1,Bob Thompson,345.0,23.0,9.5,4.0
2,Charlie Reed,123.0,18.7,7.8,3.2
3,Diana Santiago,678.0,25.2,10.2,4.5
4,Ethan Kim,342.0,21.5,9.0,3.8
5,Fiona Nguyen,123.0,24.1,10.0,4.1
6,George Patel,345.0,22.3,9.2,3.9
7,Hannah Brooks,123.0,26.0,10.5,4.3

In [48]:
# describe
df.describe()

       Hundred_Miler_Time_hrs  Fifty_Miler_Time_hrs  262_Time_hrs
count                8.000000              8.000000       8.00000
mean                22.662500              9.275000       3.91250
std                  2.438347              0.986697       0.41897
min                 18.700000              7.800000       3.20000
25%                 21.250000              8.750000       3.72500
50%                 22.650000              9.350000       3.95000
75%                 24.375000             10.050000       4.15000
max                 26.000000             10.500000       4.50000

In [52]:
# cleaning up column values
data3 = {
    'Runner': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Temperature (C)': [20, 18, np.nan, 22, 21],
    'Time (min)': [25.5, 30.2, np.nan, 22.1, 28.4],
    'Distance (km)': [5.0, np.nan, 5.0, 4.5, 5.0],
    'Location': ['Park', 'Track', 'Trail', np.nan, 'Park'],
}
df3=pd.DataFrame(data3)

In [56]:
# missing values 
df3['Time (min)'].isna()

0    False
1    False
2     True
3    False
4    False
Name: Time (min), dtype: bool

In [55]:
# return columns that have null values
df3.columns[df3.isna().any()].tolist()

['Temperature (C)', 'Time (min)', 'Distance (km)', 'Location']

In [ ]:
# fill up the na values
df3['Time (min)'] = df3['Time (min)'].fillna(30)

In [59]:
# drop rows with na values
df3_drop = df3.dropna(subset=['Distance (km)'])
df3_drop

    Runner  Temperature (C)  Time (min)  Distance (km) Location
0    Alice             20.0        25.5            5.0     Park
2  Charlie              NaN        30.0            5.0    Trail
3    David             22.0        22.1            4.5      NaN
4      Eve             21.0        28.4            5.0     Park

In [60]:
# drop off a whole column if there is any na values
df3_drop_column = df3_drop.dropna(axis=1)

In [61]:
df3_drop_column

    Runner  Time (min)  Distance (km)
0    Alice        25.5            5.0
2  Charlie        30.0            5.0
3    David        22.1            4.5
4      Eve        28.4            5.0

In [67]:
df4 = pd.DataFrame({
    ' Runner Name ': ['Alex', 'Bri', 'Chris'],
    ' Total Time ': [45, 50, 42],
    'Average Pace': [5.0, 5.5, 4.8],
    '  Calories Burned  ': [300, 320, 310]
})

In [65]:
df4.columns = df4.columns.str.strip()

In [66]:
df4

  Runner Name  Total Time  Average Pace  Calories Burned
0        Alex          45           5.0              300
1         Bri          50           5.5              320
2       Chris          42           4.8              310

In [68]:
df4.columns = df4.columns.str.replace(' ', '_')

In [69]:
df4

  _Runner_Name_  _Total_Time_  Average_Pace  __Calories_Burned__
0          Alex            45           5.0                  300
1           Bri            50           5.5                  320
2         Chris            42           4.8                  310

In [70]:
df4.columns = df4.columns.str.lower()

In [71]:
df4

  _runner_name_  _total_time_  average_pace  __calories_burned__
0          Alex            45           5.0                  300
1           Bri            50           5.5                  320
2         Chris            42           4.8                  310

In [72]:
df4[df4['average_pace'] > 5]

  _runner_name_  _total_time_  average_pace  __calories_burned__
1           Bri            50           5.5                  320

In [74]:
df4[(df4['__calories_burned__'] < 350) & (df4['_total_time_'] > 43)]

  _runner_name_  _total_time_  average_pace  __calories_burned__
0          Alex            45           5.0                  300
1           Bri            50           5.5                  320

In [75]:
df4[(df4['__calories_burned__'] < 350) | (df4['_total_time_'] > 43)]

  _runner_name_  _total_time_  average_pace  __calories_burned__
0          Alex            45           5.0                  300
1           Bri            50           5.5                  320
2         Chris            42           4.8                  310

In [78]:
df4.loc[0, '_total_time_']

np.int64(45)

In [80]:
df4.loc[:, '_total_time_':'__calories_burned__']

   _total_time_  average_pace  __calories_burned__
0            45           5.0                  300
1            50           5.5                  320
2            42           4.8                  310

In [82]:
df4.loc[:, ['_total_time_','__calories_burned__']]

   _total_time_  __calories_burned__
0            45                  300
1            50                  320
2            42                  310

In [83]:
df4.iloc[0, 0]

'Alex'

In [84]:
df4.iloc[0:2, 1:3]

   _total_time_  average_pace
0            45           5.0
1            50           5.5